podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/DeviceData/Device.SVD/Internal/peripherals/UART0_MK10D10_C7816_CEA709.svd.xml
            <register>
               <name>IE7816</name>
               <description>7816 Interrupt Enable Register</description>
               <addressOffset>0x19</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXTE</name>
                     <description>Receive Threshold Exceeded Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXTE" > <name>TXTE</name> <description>Transmit Threshold Exceeded (TXT) Interrupt Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="RXTE" > <name>GTVE</name> <description>Guard Timer Violated (GTV) Interrupt Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="RXTE" > <name>INITDE</name> <description>Initial Character Detected (INITD) Interrupt Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="RXTE" > <name>BWTE</name> <description>Block Wait Timer (BWT) Interrupt Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="RXTE" > <name>CWTE</name> <description>Character Wait Timer (CWT) Interrupt Enable</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="RXTE" > <name>WTE</name> <description>Wait Timer Interrupt Enable</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>IS7816</name>
               <description>7816 Interrupt Status Register</description>
               <addressOffset>0x1A</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXT</name>
                     <description>Receive Threshold Exceeded Interrupt\n
Set if the number of consecutive NACKS generated as a result of parity errors and buffer overruns is &gt;= the value in ET7816[RXTHRESHOLD]</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Negated</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Asserted/Write 1 to clear</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="RXT" > <name>TXT</name> <description>Transmit Threshold Exceeded Interrupt\n
Set if the number of retries and corresponding NACKS &gt; the value in the ET7816[TXTHRESHOLD] field</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>GTV</name> <description>Guard Timer Violated Interrupt\n
Set if a guard time (GT, CGT or BGT) has been violated</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>INITD</name> <description>Initial Character Detected Interrupt\n
Set when a valid initial character has been received</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>BWT</name> <description>Block Wait Timer Interrupt\n
Set when the Block Wait Time (BWT) has been violated</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>CWT</name> <description>Character Wait Timer Interrupt\n
Set when the Character Wait Time (CWT) has been violated</description> <bitOffset>6</bitOffset> </field>
                  <field derivedFrom="RXT" > <name>WT</name> <description>Wait Timer Interrupt\n
Set when the Wait Time (WT) has been violated</description> <bitOffset>7</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>WP7816T0</name>
               <description>7816 Wait Parameter Register</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <resetValue>0xA</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WI</name>
                     <description>Wait Timer Interrupt (C7816[TTYPE] = 0)</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WP7816T1</name>
               <description>7816 Wait Parameter Register</description>
               <addressOffset>0x1B</addressOffset>
               <size>8</size>
               <resetValue>0xA</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>BWI</name>
                     <description>Block Wait Time Integer(C7816[TTYPE] = 1)</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>CWI</name>
                     <description>Character Wait Time Integer (C7816[TTYPE] = 1)</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WN7816</name>
               <description>7816 Wait N Register</description>
               <addressOffset>0x1C</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GTN</name>
                     <description>Guard Band N</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>WF7816</name>
               <description>7816 Wait FD Register</description>
               <addressOffset>0x1D</addressOffset>
               <size>8</size>
               <resetValue>0x1</resetValue>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>GTFD</name>
                     <description>FD Multiplier</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>ET7816</name>
               <description>7816 Error Threshold Register</description>
               <addressOffset>0x1E</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>RXTHRESHOLD</name>
                     <description>Receive NACK Threshold\n
The value written to this field indicates the maximum number of consecutive NACKs generated as a result
of a parity error or receiver buffer overruns before the host processor is notified</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXTHRESHOLD</name>
                     <description>Transmit NACK Threshold\n
The value written to this field indicates the maximum number of failed attempts (NACKs) a transmitted
character can have before the host processor is notified</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TL7816</name>
               <description>7816 Transmit Length Register</description>
               <addressOffset>0x1F</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TLEN</name>
                     <description>Transmit Length</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>C6</name>
               <description>CEA709.1-B Control Register 6</description>
               <addressOffset>0x21</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>CP</name>
                     <description>Collision Signal Polarity</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Collision signal is active low</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Collision signal is active high</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CE</name>
                     <description>Collision Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Collision detect feature is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Collision detect feature is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TX709</name>
                     <description>CEA709.1-B Transmit Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>CEA709.1-B transmitter is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CEA709.1-B transmitter is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EN709</name>
                     <description>EN709</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>CEA709.1-B is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>CEA709.1-B is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCTH</name>
               <description>CEA709.1-B Packet Cycle Time Counter High</description>
               <addressOffset>0x22</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>PCTH</name>
                     <description>Packet Cycle Time Counter High</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PCTL</name>
               <description>CEA709.1-B Packet Cycle Time Counter Low</description>
               <addressOffset>0x23</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>PCTL</name>
                     <description>Packet Cycle Time Counter Low</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>B1T</name>
               <description>CEA709.1-B Beta1 Timer</description>
               <addressOffset>0x24</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>B1T</name>
                     <description>Beta1 Timer</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDTH</name>
               <description>CEA709.1-B Secondary Delay Timer High</description>
               <addressOffset>0x25</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SDTH</name>
                     <description>Secondary Delay Timer High</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>SDTL</name>
               <description>CEA709.1-B Secondary Delay Timer Low</description>
               <addressOffset>0x26</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>SDTL</name>
                     <description>Secondary Delay Timer Low</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>PRE</name>
               <description>CEA709.1-B Preamble</description>
               <addressOffset>0x27</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>PREAMBLE</name>
                     <description>CEA709.1-B Preamble Register</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>TPL</name>
               <description>CEA709.1-B Transmit Packet Length</description>
               <addressOffset>0x28</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TPL</name>
                     <description>Transmit Packet Length Register</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
            <register>
               <name>IE</name>
               <description>CEA709.1-B Interrupt Enable Register</description>
               <addressOffset>0x29</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>TXFIE</name>
                     <description>Transmission Fail Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <enumeratedValue>
                           <name>0b0</name>
                           <description>Interrupt is disabled</description>
                           <value>0b0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>0b1</name>
                           <description>Interrupt is enabled</description>
                           <value>0b1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field derivedFrom="TXFIE" > <name>PSIE</name> <description>Preamble Start Interrupt Enable</description> <bitOffset>1</bitOffset> </field>
                  <field derivedFrom="TXFIE" > <name>PCTEIE</name> <description>Packet Cycle Timer Interrupt Enable</description> <bitOffset>2</bitOffset> </field>
                  <field derivedFrom="TXFIE" > <name>PTXIE</name> <description>Packet Transmitted Interrupt Enable</description> <bitOffset>3</bitOffset> </field>
                  <field derivedFrom="TXFIE" > <name>PRXIE</name> <description>Packet Received Interrupt Enable</description> <bitOffset>4</bitOffset> </field>
                  <field derivedFrom="TXFIE" > <name>ISDIE</name> <description>Initial Sync Detection Interrupt Enable</description> <bitOffset>5</bitOffset> </field>
                  <field derivedFrom="TXFIE" > <name>WBEIE</name> <description>Wbase Expired Interrupt Enable</description> <bitOffset>6</bitOffset> </field>
               </fields>
            </register>
            <register>
               <name>WB</name>
               <description>CEA709.1-B WBASE</description>
               <addressOffset>0x2A</addressOffset>
               <size>8</size>
               <resetMask>0xFF</resetMask>
               <fields>
                  <field>
                     <name>WBASE</name>
                     <description>CEA709.1-B WBASE register</description>
                     <bitOffset>0</bitOffset>
                  </field>
               </fields>
            </register>
